DISTORTEC/distortos/source/chip/STM32/STM32F4/include/distortos/chip/STM32F4-USART-bits.h
#define USART_BRR_DIV_Mantissa_bit			4
#define USART_BRR_DIV_Fraction_bit			0

/*---------------------------------------------------------------------------------------------------------------------+
| USART_CR1 - Control register 1
+---------------------------------------------------------------------------------------------------------------------*/

#define USART_CR1_OVER8_bit					15
#define USART_CR1_UE_bit					13
#define USART_CR1_M_bit						12
#define USART_CR1_WAKE_bit					11
#define USART_CR1_PCE_bit					10
#define USART_CR1_PS_bit					9
#define USART_CR1_PEIE_bit					8
#define USART_CR1_TXEIE_bit					7
#define USART_CR1_TCIE_bit					6
#define USART_CR1_RXNEIE_bit				5
#define USART_CR1_IDLEIE_bit				4
#define USART_CR1_TE_bit					3
#define USART_CR1_RE_bit					2
#define USART_CR1_RWU_bit					1
#define USART_CR1_SBK_bit					0

#define USARTx_CR1_OVER8_bb(base)			BITBAND(&(base)->CR1, USART_CR1_OVER8_bit)
#define USARTx_CR1_UE_bb(base)				BITBAND(&(base)->CR1, USART_CR1_UE_bit)
#define USARTx_CR1_M_bb(base)				BITBAND(&(base)->CR1, USART_CR1_M_bit)
#define USARTx_CR1_WAKE_bb(base)			BITBAND(&(base)->CR1, USART_CR1_WAKE_bit)
#define USARTx_CR1_PCE_bb(base)				BITBAND(&(base)->CR1, USART_CR1_PCE_bit)
#define USARTx_CR1_PS_bb(base)				BITBAND(&(base)->CR1, USART_CR1_PS_bit)
#define USARTx_CR1_PEIE_bb(base)			BITBAND(&(base)->CR1, USART_CR1_PEIE_bit)
#define USARTx_CR1_TXEIE_bb(base)			BITBAND(&(base)->CR1, USART_CR1_TXEIE_bit)
#define USARTx_CR1_TCIE_bb(base)			BITBAND(&(base)->CR1, USART_CR1_TCIE_bit)
#define USARTx_CR1_RXNEIE_bb(base)			BITBAND(&(base)->CR1, USART_CR1_RXNEIE_bit)
#define USARTx_CR1_IDLEIE_bb(base)			BITBAND(&(base)->CR1, USART_CR1_IDLEIE_bit)
#define USARTx_CR1_TE_bb(base)				BITBAND(&(base)->CR1, USART_CR1_TE_bit)
#define USARTx_CR1_RE_bb(base)				BITBAND(&(base)->CR1, USART_CR1_RE_bit)
#define USARTx_CR1_RWU_bb(base)				BITBAND(&(base)->CR1, USART_CR1_RWU_bit)
#define USARTx_CR1_SBK_bb(base)				BITBAND(&(base)->CR1, USART_CR1_SBK_bit)

#define USART1_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(USART1)
#define USART1_CR1_UE_bb					USARTx_CR1_UE_bb(USART1)
#define USART1_CR1_M_bb						USARTx_CR1_M_bb(USART1)
#define USART1_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(USART1)
#define USART1_CR1_PCE_bb					USARTx_CR1_PCE_bb(USART1)
#define USART1_CR1_PS_bb					USARTx_CR1_PS_bb(USART1)
#define USART1_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(USART1)
#define USART1_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(USART1)
#define USART1_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(USART1)
#define USART1_CR1_RXNEIE_bb				USARTx_CR1_RXNEIE_bb(USART1)
#define USART1_CR1_IDLEIE_bb				USARTx_CR1_IDLEIE_bb(USART1)
#define USART1_CR1_TE_bb					USARTx_CR1_TE_bb(USART1)
#define USART1_CR1_RE_bb					USARTx_CR1_RE_bb(USART1)
#define USART1_CR1_RWU_bb					USARTx_CR1_RWU_bb(USART1)
#define USART1_CR1_SBK_bb					USARTx_CR1_SBK_bb(USART1)

#define USART2_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(USART2)
#define USART2_CR1_UE_bb					USARTx_CR1_UE_bb(USART2)
#define USART2_CR1_M_bb						USARTx_CR1_M_bb(USART2)
#define USART2_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(USART2)
#define USART2_CR1_PCE_bb					USARTx_CR1_PCE_bb(USART2)
#define USART2_CR1_PS_bb					USARTx_CR1_PS_bb(USART2)
#define USART2_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(USART2)
#define USART2_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(USART2)
#define USART2_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(USART2)
#define USART2_CR1_RXNEIE_bb				USARTx_CR1_RXNEIE_bb(USART2)
#define USART2_CR1_IDLEIE_bb				USARTx_CR1_IDLEIE_bb(USART2)
#define USART2_CR1_TE_bb					USARTx_CR1_TE_bb(USART2)
#define USART2_CR1_RE_bb					USARTx_CR1_RE_bb(USART2)
#define USART2_CR1_RWU_bb					USARTx_CR1_RWU_bb(USART2)
#define USART2_CR1_SBK_bb					USARTx_CR1_SBK_bb(USART2)

#define USART3_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(USART3)
#define USART3_CR1_UE_bb					USARTx_CR1_UE_bb(USART3)
#define USART3_CR1_M_bb						USARTx_CR1_M_bb(USART3)
#define USART3_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(USART3)
#define USART3_CR1_PCE_bb					USARTx_CR1_PCE_bb(USART3)
#define USART3_CR1_PS_bb					USARTx_CR1_PS_bb(USART3)
#define USART3_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(USART3)
#define USART3_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(USART3)
#define USART3_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(USART3)
#define USART3_CR1_RXNEIE_bb				USARTx_CR1_RXNEIE_bb(USART3)
#define USART3_CR1_IDLEIE_bb				USARTx_CR1_IDLEIE_bb(USART3)
#define USART3_CR1_TE_bb					USARTx_CR1_TE_bb(USART3)
#define USART3_CR1_RE_bb					USARTx_CR1_RE_bb(USART3)
#define USART3_CR1_RWU_bb					USARTx_CR1_RWU_bb(USART3)
#define USART3_CR1_SBK_bb					USARTx_CR1_SBK_bb(USART3)

#define UART4_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(UART4)
#define UART4_CR1_UE_bb						USARTx_CR1_UE_bb(UART4)
#define UART4_CR1_M_bb						USARTx_CR1_M_bb(UART4)
#define UART4_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(UART4)
#define UART4_CR1_PCE_bb					USARTx_CR1_PCE_bb(UART4)
#define UART4_CR1_PS_bb						USARTx_CR1_PS_bb(UART4)
#define UART4_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(UART4)
#define UART4_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(UART4)
#define UART4_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(UART4)
#define UART4_CR1_RXNEIE_bb					USARTx_CR1_RXNEIE_bb(UART4)
#define UART4_CR1_IDLEIE_bb					USARTx_CR1_IDLEIE_bb(UART4)
#define UART4_CR1_TE_bb						USARTx_CR1_TE_bb(UART4)
#define UART4_CR1_RE_bb						USARTx_CR1_RE_bb(UART4)
#define UART4_CR1_RWU_bb					USARTx_CR1_RWU_bb(UART4)
#define UART4_CR1_SBK_bb					USARTx_CR1_SBK_bb(UART4)

#define UART5_CR1_OVER8_bb					USARTx_CR1_OVER8_bb(UART5)
#define UART5_CR1_UE_bb						USARTx_CR1_UE_bb(UART5)
#define UART5_CR1_M_bb						USARTx_CR1_M_bb(UART5)
#define UART5_CR1_WAKE_bb					USARTx_CR1_WAKE_bb(UART5)
#define UART5_CR1_PCE_bb					USARTx_CR1_PCE_bb(UART5)
#define UART5_CR1_PS_bb						USARTx_CR1_PS_bb(UART5)
#define UART5_CR1_PEIE_bb					USARTx_CR1_PEIE_bb(UART5)
#define UART5_CR1_TXEIE_bb					USARTx_CR1_TXEIE_bb(UART5)
#define UART5_CR1_TCIE_bb					USARTx_CR1_TCIE_bb(UART5)
#define UART5_CR1_RXNEIE_bb					USARTx_CR1_RXNEIE_bb(UART5)
#define UART5_CR1_IDLEIE_bb					USARTx_CR1_IDLEIE_bb(UART5)
#define UART5_CR1_TE_bb						USARTx_CR1_TE_bb(UART5)
#define UART5_CR1_RE_bb						USARTx_CR1_RE_bb(UART5)
#define UART5_CR1_RWU_bb					USARTx_CR1_RWU_bb(UART5)
#define UART5_CR1_SBK_bb					USARTx_CR1_SBK_bb(UART5)

